            ### Task_13_2
'''
Создайте функцию-генератор, которая создаёт последовательность
числовых палиндромов
1,2,3,4,5,6,7,8,9,11,22,33,44,55,66,77,88,99,101,111,121,131,141,
151,161,171,181,191,202...
'''
### работа над ошибками
## Надо создать генератор создающий БЕСКОНЕЧНУЮ
# последовательность чисел, а не n чисел.
#Т.е. генератор не может принимать параметр n.
def pal_r():
    con = 0
    while True:
        con += 1
        if str(con) == str(con)[::-1]:
            yield con

res = pal_r()
n = 122
while True:
    x = next(res)
    if x <= n:
        print(x, end=',')
    else:
        break

#############################################
'''
def pal(n):
    con = 0
    while con < n:
        con += 1
        if str(con) == str(con)[::-1]:
            yield con

g = 121
for i in list(pal(g)):
    print(f'{i},', end='')
'''
